Revit 2027 API
ControlledApplication.ElementTypeDuplicating Event
 Subscribe to the ElementTypeDuplicating event to be notified when Revit is just about to duplicate an element type.
Namespace: Autodesk.Revit.ApplicationServices
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public event EventHandler<ElementTypeDuplicatingEventArgs> ElementTypeDuplicating
Public Event ElementTypeDuplicating As EventHandler(Of ElementTypeDuplicatingEventArgs)
public:
 event EventHandler<ElementTypeDuplicatingEventArgs^>^ ElementTypeDuplicating {
	void add (EventHandler<ElementTypeDuplicatingEventArgs^>^ value);
	void remove (EventHandler<ElementTypeDuplicatingEventArgs^>^ value);
}
member ElementTypeDuplicating : IEvent<EventHandler<ElementTypeDuplicatingEventArgs>,
    ElementTypeDuplicatingEventArgs>
Value
EventHandler<ElementTypeDuplicatingEventArgs>
Remarks
This event is raised when Revit is just about to duplicate an element type.
Event is cancellable. To cancel it, call the 'Cancel()' method in event's argument to True. Your application is responsible for providing feedback to the user about the reason for the cancellation.
The following API functions are not available for the current document during this event:
All overloads of Autodesk.Revit.DB.Document.Import()
Close() and similar overloads.
Save() .
SaveAs(String) and similar overloads.
Exception InvalidOperationException will be thrown if any of the above methods is called during this event.
Another ElementTypeDuplicated event will be raised immediately after duplicating an element type is finished.
See Also
Reference
ControlledApplication Class
Autodesk.Revit.ApplicationServices Namespace